(function () {
  console.log(`
  Результаты самопроверки:

Оценка - 150 баллов

  Отзыв по пунктам ТЗ:

Не выполненные/не засчитанные пункты:

1. Нет видеорезюме.
    (0)

----------------------------------
Выполненные пункты:

1. Вёрстка валидная. Проверить валидность вёрстки: https://validator.w3.org/  (+)
   (10)

2. Вёрстка семантическая. В коде страницы присутствуют семантические теги HTML5: article, aside, footer, header, main, nav, section, используются заголовки h1-h3. 2 балла за каждый уникальный семантический тег HTML5 и за каждый уникальный заголовок h1-h6.
    (20)

3. Для оформления СV используются css-стили. 1 балл за каждый стилизованный элемент, но не больше 10 баллов
    (10)

4. Контент размещается в блоке, который горизонтально центрируется на странице.  (+)
Фоновый цвет тянется во всю ширину страницы  (+)
    (10)

5. Вёрстка адаптивная  (+)
    (10)

6. Есть адаптивное бургер-меню.  (+)
Ссылки в пунктах меню ведут на основные разделы CV.  (+)
При кликах по пунктам меню реализована плавная прокрутка по якорям.  (+)
При уменьшении ширины экрана меню становится адаптивным.  (+)
    (10)

7. На странице СV присутствует изображение - фото или аватарка автора CV,   (+)
пропорции изображения не искажены,   (+)
у изображения есть атрибут alt   (+)
    (10)

8. Контакты для связи и перечень навыков оформлены в виде списка ul > li  (+)
    (10)

9. CV содержит контакты,  (+)
краткую информацию о себе,  (+)
навыки, образование,  (+)
уровень английского  (+)
    (10)

10.CV содержит пример вашего кода с подсветкой кода  (+)
    (10)

11. CV содержит изображения-ссылки на выполненные вами проекты.   (+)
При клике по изображению страница проекта открывается в новой вкладке.   (+)
У каждого проекта есть название, небольшое описание, указан перечень используемых технологий   (+)
    (10)

12. CV выполнено на английском языке   (+)
    (10)

13. Выполнены требования к репозиторию:
есть ссылка на задание,  (+)
скриншот страницы СV,  (+)
ссылка на деплой страницы CV на GitHub Pages,  (+)
указана дата дедлайна,  (+)
выполнена самооценка  (+)
    (10)

14. дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию
    (10)
  
  `);
})();
